Обработки/Reports/_МНОиДепозиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_МНОиДепозиты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючТекущегоВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_МНОиДепозиты/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область События_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация			= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.Период.ДатаНачала 	= Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата()), -2);
	Отчет.Период.ДатаОкончания 	= КонецДня(Отчет.Период.ДатаНачала);
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
		
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
	ТекНастройки = Неопределено;
	Параметры.Свойство("НастройкиОтчета", ТекНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ОбновитьЭлементыПослеИзменения();
	
КонецПроцедуры

#КонецОбласти

#Область События_Элементов_Формы

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ОбновитьЭлементыПослеИзменения(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ОбновитьЭлементыПослеИзменения(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_Процедуры_и_Функции

&НаКлиенте
Процедура ОбновитьЭлементыПослеИзменения(УстановитьНеактуальность = Ложь)
	
	Отчет.КлючТекущегоВарианта = КлючТекущегоВарианта;
	
	Если УстановитьНеактуальность Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
		
	Элементы.Результат.ИспользуемоеИмяФайла = КлючТекущегоВарианта + " на " + Формат(Отчет.Период.ДатаОкончания, "ДЛФ=D") + "_" + Отчет.СчетДоверительногоУправления + ".xlsx";
	
КонецПроцедуры

&НаКлиенте
Процедура КлючТекущегоВариантаПриИзменении(Элемент)
	
	КлючТекущегоВарианта = Отчет.КлючТекущегоВарианта;
	ОбновитьЭлементыПослеИзменения(Истина);
	
КонецПроцедуры

#КонецОбласти
